{
    "Winterfell": {
        "location_name": "临冬城",
        "location_code": "Winterfell",
        "description": "临冬城是北境的主要城堡，也是史塔克家族的家园。",
        "detail": "临冬城坐落在寒冷的北方，由灰色石头建造，坚固而古老。城堡由内城和外城组成，内城有高大的城墙和几座塔楼，外城有许多庭院、马厩和士兵宿舍。城堡中心有一个温泉池，水源来自地下的温泉，给寒冷的临冬城带来一丝温暖。临冬城的神木林是北境人心目中神圣的地方，那里有一棵古老的心树，是史塔克家族的祈祷之地。",
        "special_actions": ["会议", "祈祷", "训练"]
    },
    "King's Landing": {
        "location_name": "君临城",
        "location_code": "King's Landing",
        "description": "君临城是维斯特洛的首都，铁王座的所在地。",
        "detail": "君临城坐落在黑水河的岸边，是维斯特洛最大的城市。城中最显著的建筑是红堡，铁王座就位于其中的铁王座厅。君临城的街道狭窄而繁忙，挤满了商人、士兵和各种各样的人。市集、酒馆和贫民区都充满了喧嚣和活力。红堡外还有祈祷圣堂、高塔以及黑水河边的港口，所有这些构成了君临城独特的风貌。",
        "special_actions": ["统治", "阴谋", "战争"]
    },
    "The Wall": {
        "location_name": "长城",
        "location_code": "The Wall",
        "description": "长城是守护维斯特洛北方边境的巨大冰墙。",
        "detail": "长城由坚固的冰和雪建成，绵延数百里，横亘在维斯特洛北境与绝境长城之外的野地之间。它高耸入云，常年被冰雪覆盖。长城由守夜人守护，他们在这里驻扎，抵御来自北方的威胁。长城上有许多堡垒和哨塔，最大的堡垒是黑城堡，它是守夜人的总部。长城的尽头是东海望，一个位于海边的小镇，是守夜人和北境世界之间的主要通道。",
        "special_actions": ["守卫", "巡逻", "抵御异鬼"]
    },
    "Dragonstone": {
        "location_name": "龙石岛",
        "location_code": "Dragonstone",
        "description": "龙石岛是坦格利安家族的古老领地，位于黑水湾的一个岛屿上。",
        "detail": "龙石岛是一座由火山岩形成的小岛，岛上有一座古老而神秘的城堡。城堡的塔楼和城墙由黑色的火山岩建成，显得阴森而强大。龙石岛曾是坦格利安家族的基地，他们在这里起家，征服了七大王国。龙石岛的地理位置使它成为一个战略要地，控制着通往君临城的海路。岛上的龙穴曾是坦格利安家族饲养龙的地方，虽然龙已经消失，但岛上的遗迹仍然充满着他们的传说。",
        "special_actions": ["战略会议", "巩固统治", "策划复仇"]
    },
    "The Eyrie": {
        "location_name": "鹰巢城",
        "location_code": "The Eyrie",
        "description": "鹰巢城是维斯特洛最难以攻陷的城堡，位于高耸的山巅。",
        "detail": "鹰巢城坐落在巍峨的山顶之上，高高在云端，仿佛悬在半空中。城堡由巨石建造，只有通过一条陡峭的山道才能到达，极难进攻。城堡内的高墙和塔楼都象征着它的坚不可摧。鹰巢城是艾林家族的居所，他们统治着山谷地区。城堡内部富丽堂皇，但也寒冷而孤立。鹰巢城的月门是一道令人恐惧的悬空门，从这里可以将罪犯直接抛下悬崖，坠入深渊。",
        "special_actions": ["裁决", "坚守", "眺望"]
    },
    "TwinTowers": {
        "location_name": "孪河城",
        "location_code": "TwinTowers",
        "description": "孪河城是弗雷家族的城堡，位于河间地的重要战略位置。",
        "detail": "孪河城坐落在红叉河北岸，是河间地弗雷家族的领地。城堡由两座高塔组成，耸立于红叉河两侧，由一座坚固的桥梁连接，控制着通向北境和南部的重要通道。弗雷家族通过这座桥梁收取过桥费，积累了大量财富。孪河城不仅在地理位置上显得至关重要，还以其家族的狡诈和复杂的内部关系而闻名。城堡内装饰简朴，冷酷而功能性强。它是血色婚礼发生的场所，弗雷家族在这里背叛了史塔克家族。",
        "special_actions": ["背叛", "封锁", "谈判"]
    }
    
}