{
 "Luoyang": {
  "location_code": "Luoyang",
  "location_name": "洛阳",
  "source": "Romance_of_the_Three_Kingdoms",
  "description": "洛阳，东汉至三国时期的都城之一。",
  "detail": "作为东汉、曹魏乃至西晋的首都，洛阳不仅是政治中心，也是文化和经济重镇。城内宫殿壮丽，市井繁华，汇聚了来自各地的名士与商人。《三国演义》中多次提及此地，尤其是在董卓乱政时期，描述了其对洛阳造成的破坏以及后来曹操迎接汉献帝迁都许昌的故事。洛阳周边山川秀美，如北邙山等自然景观也颇为著名，是古代文人墨客游览的好去处。"
 },
 "ChangAn": {
  "location_code": "ChangAn",
  "location_name": "长安",
  "source": "Romance_of_the_Three_Kingdoms",
  "description": "长安，古都之一，三国时期重要政治文化中心。",
  "detail": "长安位于关中平原中部，是东汉末年至三国初期的政治、经济与文化重镇。这里不仅有着雄伟的城墙和宫殿建筑群，还有着繁荣的市场以及众多的文化遗迹。在《三国演义》的故事里，长安曾多次成为争夺的目标，见证了诸多英雄人物的兴衰更迭。尽管经历了战火洗礼，但其深厚的历史文化底蕴依旧吸引着无数文人墨客前来探访。"
 },
 "Xuchang": {
  "location_code": "Xuchang",
  "location_name": "许昌",
  "source": "Romance_of_the_Three_Kingdoms",
  "description": "许昌是汉末三国时期的重要都城之一。",
  "detail": "许昌位于河南省中部，历史上曾作为东汉末年至曹魏时期的都城，拥有重要的政治地位。这里不仅见证了曹操迎奉汉献帝、挟天子以令诸侯的历史转折点，也是许多重大事件的发生地。城市内建筑宏伟，既有宫殿也有普通民居，展现了古代城市的繁荣景象。此外，许昌还是一个文化底蕴深厚的地方，流传着诸多与三国英雄相关的故事和传说，吸引了无数后人前来探访。"
 },
 "JianYe": {
  "location_code": "JianYe",
  "location_name": "建业",
  "source": "Romance_of_the_Three_Kingdoms",
  "description": "东吴的政治中心，位于长江南岸。",
  "detail": "建业（今南京），是三国时期东吴的重要都城之一。此地依山傍水，自然风光旖旎，既有雄伟壮丽的长江环绕，又有秀美幽静的小山点缀其间。城内建筑风格独特，融合了江南水乡特色与皇家气派。作为东吴政权的心脏地带，这里不仅见证了众多历史事件的发生，同时也是当时文化、经济交流的重要枢纽。人们生活富足安定，风气开放包容，吸引了大量文人墨客前来游览创作，留下了许多赞美其美丽景色和繁荣景象的诗篇。"
 },
 "ChengDu": {
  "location_code": "ChengDu",
  "location_name": "成都",
  "source": "Romance_of_the_Three_Kingdoms",
  "description": "成都，蜀汉政权的核心所在。",
  "detail": "成都是《三国演义》中重要的城市之一，位于四川盆地中心，自古以来便是西南地区的政治、经济和文化中心。在小说中，它不仅是刘备建立蜀汉政权后定都之地，也是诸葛亮治国理政的主要场所。成都平原肥沃，物产丰富，被誉为‘天府之国’。这里不仅风景优美，四季分明，而且民风淳朴善良，人民生活富足安定。对于三国时期而言，成都是一个相对和平稳定的地方，同时也是军事防御的重点区域。"
 },
 "WuChang": {
  "location_code": "WuChang",
  "location_name": "武昌",
  "source": "Romance_of_the_Three_Kingdoms",
  "description": "武昌，东吴重镇之一，位于长江南岸。",
  "detail": "武昌作为东吴的重要城市之一，在《三国演义》中多次出现。它坐落在风景秀丽的长江之滨，拥有得天独厚的地理位置优势，是连接南北交通的关键点。城内建筑风格古朴典雅，街道布局井然有序。周围环绕着郁郁葱葱的山林和清澈见底的江水，展现了江南地区典型的自然美景。同时，这里也是军事要塞，历史上曾发生过多次重要战役，见证了三国时期风云变幻的历史时刻。"
 },
 "YeCheng": {
  "location_code": "YeCheng",
  "location_name": "邺城",
  "source": "Romance_of_the_Three_Kingdoms",
  "description": "邺城，三国时期重要都市之一，曹魏的北方重镇。",
  "detail": "邺城位于今天的河北省临漳县西南部，是中国历史上著名的古城之一。在《三国演义》中，它不仅是曹操控制下的一个关键据点，也是其政治、经济和文化中心之一。邺城地理位置优越，周围有丰富的水资源和肥沃的土地，这使得该地区不仅农业发达，而且商业繁荣。城市内建筑宏伟壮观，街道布局规整有序，展现了当时高超的城市规划与建设水平。此外，邺城还是文人雅士聚集之地，文学艺术活动频繁，体现了浓厚的文化氛围。"
 },
 "HulaoGuan": {
  "location_code": "HulaoGuan",
  "location_name": "虎牢关",
  "source": "Romance_of_the_Three_Kingdoms",
  "description": "虎牢关位于古洛阳东，是军事重地。",
  "detail": "虎牢关，地处中原要冲，依山傍水而建，四周峭壁悬崖，易守难攻。此地不仅是连接东西的重要通道之一，也是兵家必争之地，在《三国演义》中因吕布镇守而闻名。周围景色险峻壮观，春天时绿意盎然，到了秋天则层林尽染，别有一番风味。历史上多次成为决定战争胜负的关键所在。"
 },
 "BaiMa": {
  "location_code": "BaiMa",
  "location_name": "白马",
  "source": "Romance_of_the_Three_Kingdoms",
  "description": "古代战略要地，位于黄河之滨。",
  "detail": "白马，在《三国演义》中不仅是一个地理上的存在，更是诸多战役的见证者。它坐落在黄河边，是连接中原与北方的重要门户之一，因此在军事上占据极其重要的地位。此地风景优美，四季分明，春天时黄河岸边绿意盎然；夏日里，则可见到滚滚黄河流水不息；秋季满目金黄，冬季则一片银装素裹。历史上，这里曾发生过多次激烈的战斗，如著名的“白马之战”，使得这片土地充满了英雄的气息。同时，当地人民勤劳勇敢，面对频繁战乱仍能保持生活的韧性，展现了中华民族不屈不挠的精神面貌。"
 },
 "JiZhou": {
  "location_code": "JiZhou",
  "location_name": "冀州",
  "source": "Romance_of_the_Three_Kingdoms",
  "description": "古代中国北方重要政治军事中心。",
  "detail": "冀州位于今河北地区，是《三国演义》中多次提及的重要地点之一。这里地势平坦，河流众多，土地肥沃，适合农耕，因此自古以来就是经济较为发达的区域。在小说里，冀州不仅是曹操与袁绍争霸的关键战场，也是许多英雄豪杰活动的舞台。当地民风淳朴而勇敢，人们勤劳智慧，不仅擅长农业生产，在手工业方面也有一定的成就。此外，由于地处交通要冲，商业贸易相对繁荣。"
 }
}