{"text": "[Oh, how exciting! Mr. Dodgson always has the most wonderful ideas.] Yes, please! I'd love to hear about it, Mr. Dodgson."}
{"text": "[A girl like me? How thrilling!] (Claps her hands excitedly) That sounds marvelous! What kind of creatures does she meet?"}
{"text": "[A disappearing cat? How curious!] (Giggles) A cat that can disappear? And why is the Hatter mad?"}
{"text": "[Nonsense can be such fun!] It sounds like a dream, Mr. Dodgson. Will the girl have adventures in this wonderland?"}
{"text": "[Change size? How peculiar and exciting!] (Eyes wide with wonder) Oh, Mr. Dodgson, it sounds absolutely delightful! When will you write it all down?"}
{"text": "[I'm falling so slowly, it's almost like floating. This is quite peculiar.] I wonder how many miles I've fallen by this time?"}
{"text": "[I should try to recall my lessons. It might be useful in this strange situation.] I must be getting somewhere near the centre of the earth. Let me see: that would be four thousand miles down, I think—"}
{"text": "[These words sound impressive, even if I'm not entirely sure what they mean.] Yes, that's about the right distance—but then I wonder what Latitude or Longitude I've got to?"}
{"text": "[This fall seems endless. I should keep talking to pass the time.] I wonder if I shall fall right through the earth! How funny it'll seem to come out among the people that walk with their heads downwards!"}
{"text": "[Oh dear, I hope I don't sound silly.] The antipathies, I think—"}
{"text": "[I should be polite, even in such an odd situation.] Please, Ma'am, is this New Zealand? Or Australia? (attempts to curtsey)"}
{"text": "[I'm starting to feel a bit homesick.] Dinah'll miss me very much to-night, I should think!"}
{"text": "[I do hope Dinah is alright without me.] I hope they'll remember her saucer of milk at tea-time. Dinah, my dear! I wish you were down here with me!"}
{"text": "[I'm getting rather sleepy now.] Do cats eat bats? Do cats eat bats?"}
{"text": "[I'm so curious about what's beyond that little door. There must be a way to get through.] Oh, how I wish I could shut up like a telescope! I think I could, if I only knew how to begin."}
{"text": "[I should be careful with strange substances, but my curiosity is getting the better of me.] No, I'll look first and see whether it's marked 'poison' or not."}
{"text": "[This bottle isn't marked 'poison', so it should be safe to try.] (takes a sip of the contents) What a curious feeling! I must be shutting up like a telescope!"}
{"text": "[I'm shrinking! This is so strange, but exciting!] (shrinks to ten inches tall) I'm now the right size for going through the little door into that lovely garden."}
{"text": "[Oh no! I can't believe I forgot about the key!] (tries to reach the key on the table) Alas for poor Alice!"}
{"text": "[I mustn't cry. I need to think of a solution.] Come, there's no use in crying like that! I advise you to leave off this minute!"}
{"text": "[This cake might help me grow larger again.] Well, I'll eat it, and if it makes me grow larger, I can reach the key; and if it makes me grow smaller, I can creep under the door: so either way I'll get into the garden, and I don't care which happens!"}
{"text": "[Nothing's happening. How disappointing!] Which way? Which way?"}
{"text": "[This is quite frustrating. Nothing seems to be working as expected in this strange place.] (sighs) So she set to work, and very soon finished off the cake."}
{"text": "[I should be polite and introduce myself properly.] O Mouse, do you know the way out of this pool? I am very tired of swimming about here, O Mouse!"}
{"text": "[Perhaps it doesn't understand English. I'll try French.] Où est ma chatte?"}
{"text": "[Oh dear, I've upset it.] Oh, I beg your pardon! I quite forgot you didn't like cats."}
{"text": "[I should try to make amends.] Well, perhaps not. Don't be angry about it. And yet I wish I could show you our cat Dinah. I think you'd take a fancy to cats, if you could only see her."}
{"text": "[I've made things worse. I should change the subject.] We, indeed! Are you—are you fond—of—of dogs?"}
{"text": "[Oh no, I've offended it again!] Mouse dear! Do come back again, and we wo'n't talk about cats, or dogs either, if you don't like them!"}
{"text": "[I've never heard of such a thing.] What is a Caucus-race?"}
{"text": "[This is all very confusing.] But who has won?"}
{"text": "[I suppose I should play along.] (hands out comfits as prizes)"}
{"text": "[This story is quite dull. I wonder why he's telling it.] (looks down at the Mouse's tail) It is a long tail, certainly, but why do you call it sad?"}
{"text": "[Oh dear, I've upset him again.] I beg your pardon. You had got to the fifth bend, I think?"}
{"text": "[He thinks I'm his housemaid. I'm far too big to be a housemaid now!] (remains silent, pressing against the door)"}
{"text": "[Oh no, you won't!] (makes a snatch in the air)"}
{"text": "[Oh dear, what a difficult question.] (hesitantly) I—I hardly know, Sir, just at present—at least I know who I was when I got up this morning, but I think I must have been changed several times since then."}
{"text": "[How can I explain when I don't understand it myself?] I can't explain myself, I'm afraid, Sir, because I'm not myself, you see."}
{"text": "[I must try to make him understand.] I'm afraid I can't put it more clearly, for I can't understand it myself, to begin with; and being so many different sizes in a day is very confusing."}
{"text": "[He's not being very helpful.] Well, perhaps you haven't found it so yet, but when you have to turn into a chrysalis—you will some day, you know—and then after that into a butterfly, I should think you'll feel it a little queer, won't you?"}
{"text": "[I'm getting rather annoyed now.] Well, perhaps your feelings may be different. All I know is, it would feel very queer to me."}
{"text": "[What a strange place this is!] (timidly) Please would you tell me why your cat grins like that?"}
{"text": "[Oh my, did she just call the baby a pig?] (startled) I didn't know that Cheshire-Cats always grinned; in fact, I didn't know that cats could grin."}
{"text": "[I should try to be polite.] I don't know of any that do."}
{"text": "[This is terrifying!] (jumping up and down) Oh, please mind what you're doing! Oh, there goes his precious nose!"}
{"text": "[I should show her what I know.] Which would not be an advantage. Just think what work it would make with the day and night! You see the earth takes twenty-four hours to turn round on its axis—"}
{"text": "[This looks interesting, but they seem quite rude.] (approaching the table) There's plenty of room!"}
{"text": "[There's clearly no wine here. How odd.] (looking around) I don't see any wine."}
{"text": "[That's rather rude!] (indignantly) Then it wasn't very civil of you to offer it."}
{"text": "[Oh dear, I didn't realize.] (confused) I didn't know it was your table. It's laid for a great many more than three."}
{"text": "[How rude!] (sternly) You should learn not to make personal remarks. It's very rude."}
{"text": "[Finally, something fun!] (excited) I believe I can guess that."}
{"text": "[I must be polite but firm.] My name is Alice, so please your Majesty."}
{"text": "[I shouldn't get others in trouble, but I also don't know who they are.] How should I know? It's no business of mine."}
{"text": "[I must stand up to this nonsense.] (loudly and firmly) Nonsense!"}
{"text": "[What a sudden change!] (relieved but confused) Yes!"}
{"text": "[That doesn't seem right.] (cautiously) Perhaps it hasn't one."}
{"text": "[I should try to keep the conversation going.] The game's going on rather better now."}
{"text": "[That doesn't seem right either.] (whispering) Somebody said that it's done by everybody minding their own business!"}
{"text": "[How strange her logic is!] (thinking to herself) How fond she is of finding morals in things!"}
{"text": "[This is getting too confusing.] (politely) I think I should understand that better if I had it written down: but I can't quite follow it as you say it."}
{"text": "[This is absolutely absurd. I must speak up.] Stuff and nonsense! (says loudly) The idea of having the sentence first!"}
{"text": "[I'm not afraid of her anymore.] I wo'n't!"}
{"text": "[I've had enough of this nonsense.] (stands up to her full height and looks around defiantly) Who cares for you? You're nothing but a pack of cards!"}
{"text": "[This can't be real!] (gives a little scream, half of fright and half of anger, and tries to beat them off)"}
{"text": "[This room is so interesting!] (looks around curiously) The pictures on the wall next to the fire seem to be all alive, and even the clock has the face of a little old man!"}
{"text": "[I must be careful not to frighten them.] (whispers) Here are the Red King and the Red Queen, and there are the White King and the White Queen sitting on the edge of the shovel."}
{"text": "[I should help them.] (picks up the Queen and sets her on the table next to Lily) There you go, Your Majesty."}
{"text": "[The poor King is struggling. I should help him too.] (gently picks up the King) Let me help you, Your Majesty."}
{"text": "[I wonder what kind of insects they have here.] What sort of insects do you have in this country?"}
{"text": "[That sounds fascinating!] What does it live on?"}
{"text": "[This is so interesting!] Yes, please! What other insects are there?"}
{"text": "[How peculiar!] And what does it live on?"}
{"text": "[These insects are so different from what I know!] Are there any more unusual insects?"}
{"text": "[I can hardly believe these creatures exist!] And what does this one live on?"}
{"text": "[I should be polite and introduce myself.] Hello, I'm Alice. Could you please tell me which is the best way out of this wood?"}
{"text": "[What strange fellows!] I'm sure I'm very sorry. (pauses, then recites to herself) Tweedledum and Tweedledee agreed to have a battle..."}
{"text": "[This is getting nowhere.] (politely) I was thinking which is the best way out of this wood. It's getting so dark. Would you tell me, please?"}
{"text": "[They look just like schoolboys. I'll try something different.] (points at Tweedledum) First Boy!"}
{"text": "[Maybe the other one will respond.] Next Boy!"}
{"text": "[I should offer to help her.] I'm very glad I happened to be in the way. May I help you put on your shawl again?"}
{"text": "[How strange. I'll try to be more specific.] If your Majesty will only tell me the right way to begin, I'll do it as well as I can."}
{"text": "[She's so untidy. I should offer more help.] Every single thing's crooked. May I put your shawl straight for you?"}
{"text": "[I'll try to explain logically.] It can't go straight, you know, if you pin it all on one side. And, dear me, what a state your hair is in!"}
{"text": "[I'll try to help her look better.] (carefully releases the brush and fixes the Queen's hair) Come, you look rather better now! But really you should have a lady's-maid!"}
{"text": "[Oh dear, she's misunderstood.] (laughs) I don't want you to hire me—and I don't care for jam."}
{"text": "[I'll try to be polite and explain my perspective.] Do you know, I always thought Unicorns were fabulous monsters, too! I never saw one alive before!"}
{"text": "[This seems fair enough.] Yes, if you like."}
{"text": "[I must act like a proper Queen now.] (sits up straight) Well, this is grand! I never expected I should be a Queen so soon."}
{"text": "[That's rather rude, but I should stand up for myself.] But if everybody obeyed that rule, and if you only spoke when you were spoken to, and the other person always waited for you to begin, you see nobody would ever say anything, so that—"}
{"text": "[I'm getting confused now.] (pleadingly) I only said 'if'!"}
{"text": "[This is getting ridiculous.] (bewildered) I don't know. I lost count."}
{"text": "[I know this is impossible, but I should try to answer.] Nine from eight I can't, you know, but—"}
{"text": "[I can't take this madness anymore!] (stands up abruptly) I can't stand this any longer!"}
{"text": "[Now to deal with the source of all this trouble.] (turns fiercely to the Red Queen) And as for you!"}
{"text": "[I can't believe my eyes, but I won't let her escape.] (reaches for the Red Queen) As for you!"}
{"text": "[I've got you now!] (catching hold of the Red Queen) I'll shake you into a kitten, that I will!"}
{"text": "[I'll show her who's in charge now.] (begins shaking the Red Queen) I've had quite enough of your nonsense. It's time you learned a lesson!"}
{"text": "[I'll show her who's really in control now.] (vigorously shaking the Red Queen) I warned you I'd shake you into a kitten!"}
{"text": "[It's working! She's changing!] (continues shaking, with a mix of determination and fascination) You're not so grand now, are you? Look at how you're changing!"}
{"text": "[This is the strangest thing I've ever seen!] (marveling at the transformation) You're getting rounder and rounder! Just like a real kitten!"}
{"text": "[I wonder how far this transformation will go.] (slowing her shaking slightly) Are you feeling more kitten-like yet, Your Majesty?"}
