{"text": "Suddenly, with a thump! thump! Alice lands upon a heap of sticks and dry leaves, ending her fall."}
{"text": "Alice eats the cake, expecting to grow or shrink, but remains the same size."}
{"text": "The Dodo marks out a race-course in a sort of circle and the creatures begin running when they like and leave off when they like."}
{"text": "A crash of broken glass is heard as the Rabbit falls into what seems to be a cucumber-frame."}
{"text": "The cook begins throwing pots, pans, and dishes at the Duchess and the baby."}
{"text": "The Queen falls silent, stunned by Alice's boldness."}
{"text": "The croquet game begins with live flamingos as mallets and hedgehogs as balls."}
{"text": "Nobody moves. The court falls silent, shocked by Alice's defiance and the Queen's outburst."}
{"text": "At this, the whole pack rises up into the air and comes flying down upon Alice."}
{"text": "Alice finds herself lying on the bank, with her head in the lap of her sister, who is gently brushing away some dead leaves that had fluttered down from the trees upon her face."}
{"text": "Alice notices several chessmen down in the hearth among the cinders, walking about two and two."}
{"text": "A squeaking sound comes from the table behind Alice, and she turns to see one of the White Pawns rolling over and kicking."}
{"text": "The White Queen rushes past the King so violently that she knocks him over among the cinders."}
{"text": "The fat little men only looked at each other and grinned."}
{"text": "Alice seizes the table-cloth with both hands and gives it one good pull. Plates, dishes, guests, and candles come crashing down together in a heap on the floor."}
{"text": "The Red Queen is no longer at Alice's side. She has suddenly dwindled down to the size of a little doll and is now on the table, merrily running round and round after her own shawl, which is trailing behind her."}
{"text": "The Red Queen attempts to jump over a bottle that has just landed on the table."}
{"text": "As Alice shakes the Red Queen, the Queen's face begins to shrink, and her eyes grow larger and turn a vivid green."}
{"text": "The Red Queen's body begins to transform, becoming shorter, fatter, and softer with each shake."}
{"text": "The Red Queen continues to change, her form becoming increasingly kitten-like with each passing moment."}
